
## Plan Result

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/15015705472)


<pre><code>Plan: 0 to add, 17 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_zero_trust_access_application.applications[&#34;alloy-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;cadvisor-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;esphome-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;gate&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;grafana-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;hass-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;kodi-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;msr-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;prometheus-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;transmission&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;uzg-01&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;zigbee2mqtt-rpi&#34;]
  * cloudflare_zero_trust_access_identity_provider.google_oauth
  * cloudflare_zero_trust_access_policy.allow_all
  * cloudflare_zero_trust_access_policy.google_sso_access
  * cloudflare_zero_trust_access_policy.uptimerobot_direct_access


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_zero_trust_access_application.applications["alloy-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "5aa1a2eac9c010765f288628c114c9762f087eee168bd528594071802aa5b94c" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "alloy-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "ec4db0d2-7033-4148-b870-c4270139e540"
      + landing_page_design          = (known after apply)
        name                         = "alloy-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "alloy-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:34Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["cadvisor-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "4d7061291e49ca3ac3f0e2f7eca6287075d072e0067a1b65c6dbdbc42f7016ae" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:10Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "cadvisor-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "63384a1c-64fa-4829-826e-6b4bcf138487"
      + landing_page_design          = (known after apply)
        name                         = "cadvisor-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "cadvisor-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["esphome-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "8e8ce559197e93fe7997a98fb776a52a3cf807e39d35928597d5497ebf65d1fc" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "esphome-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "fa2dbbc1-f275-44d6-99d4-67a78242cd09"
      + landing_page_design          = (known after apply)
        name                         = "esphome-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "esphome-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "rpi",
            "container",
            "iot",
          + "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["gate"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "72c6ea1a9b2031813feb4f1f96fd26564d6651b364a03ec99c2511dc39186c00" -> (known after apply)
      ~ created_at                   = "2025-05-14T07:53:18Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "gate.xvx.cz" -> null
            },
        ] -> null
        id                           = "f46695de-6d58-4c20-a64c-4b559909d9f2"
      + landing_page_design          = (known after apply)
        name                         = "gate"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "gate.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          + "lan",
            "router",
            "wan",
          - "lan",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["grafana-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "4f1345d9ed6480a6815190f65f69c37c6c811f6b9a7d07d1cc73a6530595bf76" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "grafana-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "59ea1b37-74c5-4704-ab7a-448aa6301790"
      + landing_page_design          = (known after apply)
        name                         = "grafana-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "grafana-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["hass-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "e8a2833d05c5ddba41c92a8659b95510b37dd06b2b3dfca978b84a2ed4d94a64" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:10Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "hass-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "b2dfe473-1781-4dc1-aedd-12b8fa085abf"
      + landing_page_design          = (known after apply)
        name                         = "hass-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "f2ea6f70-de33-4e8a-8f0e-3e6db37c6a69"
              - include    = [
                  - {
                      - everyone = {} -> null
                    },
                ] -> null
              - name       = "Allow All" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "hass-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "rpi",
            "container",
            "iot",
          + "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["kodi-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "3b8a30bfd1ffd496a06c803ffdde4250fa00ddc359f310a33f2d0c2f778ffabc" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "kodi-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "938fc2ec-6543-45be-a5fb-d5732333fb73"
      + landing_page_design          = (known after apply)
        name                         = "kodi-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] 90m-> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "kodi-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["msr-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "44196a1a2a31f9de7e9606e2fb3b345464d1be5d64323361b3cb3a060b32c361" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "msr-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "a52a1a8a-3783-419e-a417-e22499760c4b"
      + landing_page_design          = (known after apply)
        name                         = "msr-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "msr-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "iot",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["prometheus-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "ae0279169f54c8a0727e8059f889ee7527503b28a0a8fa052b2a59885d0095f4" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "prometheus-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "dbef68a1-50d1-4e4e-ad8c-1107d466bd1a"
      + landing_page_design          = (known after apply)
        name                         = "prometheus-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "prometheus-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:34Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "b7a803fa2d3fc41dd4806e71a091433798fe37deb15f61ec0e72c6dda70af517" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "a45b048c-e9b0-4080-b34b-9dbb18fca939"
      + landing_page_design          = (known after apply)
        name                         = "rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "rpi",
            "container",
          + "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["transmission"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "f52265b960f266ba905e0b81327725ea3ed2ea8b0830189711253b99670555df" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:10Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "transmission.xvx.cz" -> null
            },
        ] -> null
        id                           = "078d4df8-d904-4d92-b5bf-e8e5b08cd8bd"
      + landing_page_design          = (known after apply)
        name                         = "transmission"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "transmission.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "router",
        ]
      ~ updated_at                   = "2025-05-14T08:15:34Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["uzg-01"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "898bdd3e4da872a97613d91f267c82f8d927f5a98c3a6b120954acaa5b1b0340" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "uzg-01.xvx.cz" -> null
            },
        ] -> null
        id                           = "35d40417-6d31-4832-b047-582e49f7c2c2"
      + landing_page_design          = (known after apply)
        name                         = "uzg-01"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "uzg-01.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "lan",
            "iot",
          + "lan",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "876abc9b4a5ca5e788473ffaf5c21fabdf8ff1f0b81a3f57e4715324f78c6e5b" -> (known after apply)
      ~ created_at                   = "2025-05-13T06:44:09Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "zigbee2mqtt-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "21d3d48b-6360-44f8-bef1-c87051700114"
      + landing_page_design          = (known after apply)
        name                         = "zigbee2mqtt-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "b5b64409-9bb0-4e2a-9564-0268c7c2795d" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "zigbee2mqtt-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "rpi",
            "container",
            "iot",
          + "rpi",
            "wifi",
        ]
      ~ updated_at                   = "2025-05-14T08:15:32Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.google_oauth will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "google_oauth" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://xvxcz.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        id          = "984fa76c-21de-405c-9646-c955147273a4"
        name        = "Google IDP"
      ~ scim_config = {
          ~ enabled                  = false -> (known after apply)
          + identity_update_behavior = (known after apply)
          + scim_base_url            = (known after apply)
          ~ seat_deprovision         = false -> (known after apply)
          + secret                   = (sensitive value)
          ~ user_deprovision         = false -> (known after apply)
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.allow_all will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "allow_all" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-13T06:44:07Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "f2ea6f70-de33-4e8a-8f0e-3e6db37c6a69"
        name             = "Allow All"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-14T08:15:28Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.google_sso_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "google_sso_access" {
      ~ app_count        = 12 -> (known after apply)
      ~ created_at       = "2025-05-13T06:44:07Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "2ed4bba2-34a8-43bb-afbb-efa82e9bd96b"
        name             = "Google SSO Access"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-14T08:15:28Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.uptimerobot_direct_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "uptimerobot_direct_access" {
      ~ app_count        = 12 -> (known after apply)
      ~ created_at       = "2025-05-13T06:44:08Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "ca1b7a48-77b5-4e14-a1de-8decc316ae27"
        name             = "UptimeRobot Direct Access"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-14T08:15:31Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tofu-cloudflare","PRNumber":190,"Program":"tfcmt","SHA1":"c4440268eea44ead77ef1a5a70ebd0d81a37299e","Vars":{},"WorkflowName":"tofu-cloudflare"} -->